<?php
return array(

	//index.html
	'1000'	=> '新社区',
	'1001'	=> '<b>创新社区新体验，内容互动性强，交流更方便</b><br><em>简单</em><em>快捷</em><em>方便</em><em>建设本地化，垂直型社区</em>',
	'1002'	=> '加入我们',
	
	'1003'	=> '登录',
	'1004'	=> 'Email',
	'1005'	=> '密码',
	'1006'	=> '忘记密码',
	'1007'	=> '推荐小组',
	'1008'	=> '全部小组',
	'1009'	=> '小组分类',
	'1010'	=> '全部小组分类',
	'1011'	=> '创建小组',
	'1012'	=> '新成立',
	'1013'	=> '搜索',
	
	//my.html
	'1020'	=> '最新话题',
	'1021'	=> '我发起的话题',
	'1022'	=> '我回应的话题',
	'1023'	=> '我收藏的话题',
	
	'1024'	=> '社区搜索',
	'1025'	=> '我管理的小组',
	'1026'	=> '全部',
	'1027'	=> '我的小组',
	
	'1030'	=> '作者',
	'1031'	=> '小组',
	'1032'	=> '去我的小组',
	
	//new_topic.html 
	'1040'	=> '发布帖子',
	'1041'	=> '不好意思，你不是本组成员不能发表帖子，请加入后再发帖^_^',
	'1042'	=> '标题：',
	'1043'	=> '分类：',
	'1044'	=> '选择分类',
	'1045'	=> '内容：',
	'1046'	=> '评论：',
	'1047'	=> '允许',
	'1048'	=> '不允许',
	'1049'	=> '标签：',
	'1050'	=> '(多个标签请用 英文,号分开)',
	'1051'	=> '好了，发布',
	'1052'	=> '返回小组',
	
	//topic.html 
	'1060'	=> '来自: ',
	'1061'	=> '置顶',
	'1062'	=> '取消置顶',
	'1063'	=> '隐藏',
	'1064'	=> '显示',
	'1065'	=> '移动',
	'1066'	=> '修改',
	'1067'	=> '删除',
	'1068'	=> '收藏',
	'1069'	=> '添加标签',
	'1070'	=> '添加',
	'1071'	=> '回复',
	'1072'	=> '提交回复',
	'1073'	=> '你的回应',
	'1074'	=> '不是本组成员不能回应此贴哦^_^',
	'1075'	=> '本帖除作者外不允许任何人评论^_^',
	'1076'	=> '加上去',
	'1077'	=> '返回',
	'1078'	=> '+在该组发布帖子',
	'1079'	=> '谁收藏了这篇帖子',
	'1080'	=> '正在加载中...',
	'1081'	=> '最新话题:',
	
	//edit_*.html 
	'1090'	=> '更改',
	'1091'	=> '的小组设置',
	'1092'	=> '基本信息',
	'1093'	=> '小组图标',
	'1094'	=> '小组分类',
	'1095'	=> '帖子分类',
	
	'1096'	=> '小组名称:',
	'1097'	=> '小组介绍:',
	'1098'	=> '加入方式:',
	'1099'	=> '自由加入',
	'1100'	=> '禁止加入',
	'1101'	=> '浏览权限：',
	'1102'	=> '完全开放',
	'1103'	=> '仅组员',
	'1104'	=> '自定义角色名称：',
	'1105'	=> '小组组长：',
	'1106'	=> '小组管理员：',
	'1107'	=> '小组成员：',
	'1108'	=> '更新小组设置',
	'1109'	=> '返回',
	'1110'	=> '小组',
	
	'1111'	=> '小组目前还没有分类。你可以根据小组内容决定小组属于哪个类别。你能选择最多两个。',
	'1112'	=> '你现在小组所在的类别是：',
	'1113'	=> '删除',
	'1114'	=> '增加一个新类别',
	
	'1115'	=> '从你的电脑上选择图像文件：(仅支持jpg，gif，png格式图片)',
	
	'1116'	=> '确定',
	'1117'	=> '取消',
	'1118'	=> '点击进行编辑。。。',
	'1119'	=> '确定删除吗?',
	'1120'	=> '删除成功！',
	'1121'	=> '添加帖子分类：',
	'1122'	=> '提交',
	
	//create.html 
	'1130'	=> '申请创建小组',
	'1131'	=> '请登陆后再申请创建小组哦',
	'1132'	=> '点击登陆',
	'1133'	=> '暂停申请创建小组，稍后开放',
	'1134'	=> '返回我的小组',
	'1135'	=> '小组名称：',
	'1136'	=> '小组分类：',
	'1137'	=> '请选择',
	'1138'	=> '小组介绍：',
	'1139'	=> '我已认真阅读并同意《社区指导原则》和《免责声明》',
	'1140'	=> '创建小组',
	
	//all.html
	'1145'	=> '全部小组',
	'1146'	=> '最新小组',
	'1147'	=> '创建于',
	'1148'	=> '人',
	'1149'	=> '推荐小组',
	
	//cate.html
	
	'1155'	=> '小组分类',
	'1156'	=> '添加',
	'1157'	=> '到',
	'1158'	=> '小组分类',
	'1159'	=> '去小组首页',
	
	//explore.html
	'1160'	=> '随便看看',
	'1161'	=> '最新活跃会员',
	'1162'	=> '社区标签',
	'1163'	=> '推荐小组',
	'1164'	=> '最新回应帖子',
	'1165'	=> '最新加入会员',
	'1166'	=> '最新成立小组',
	
	//group.html
	'1170'	=> '创建于',
	'1171'	=> '我是这个小组的',
	'1172'	=> '退出小组',
	'1173'	=> '加入小组',
	'1174'	=> '发布帖子',
	'1175'	=> '最新加入成员',
	'1176'	=> '成员管理',
	'1177'	=> '修改小组设置',
	'1178'	=> '回收站',
	'1179'	=> '浏览所有成员',
	
	//topic_edit.html
	'1180'	=> '编辑：',
	'1181'	=> '好了，提交修改',
	
	//theme.html
	'1185'	=> '更换主题',
	
	//group_isaudit.html 
	'1186'	=> '组长',
	'1187'	=> '小组正在审核中',
	
	//group_isopen.html
	'1188'	=> '推荐',
	'1189'	=> '加入方式: 自由加入 浏览权限: 仅成员',
	'1190'	=> '成员',
	'1191'	=> '帖子',
	'1192'	=> '本页永久链接',
	
	//topic_tag.html 
	'1200'	=> '话题讨论',
	'1201'	=> '热门标签',
	
	//topic_move.html 
	'1205'	=> '移动帖子：',
	'1206'	=> '选择小组：',
	'1207'	=> '移动',
	
	
);