<?php
return array(

	//index.html
	'1000'	=> '新社區',
	'1001'	=> '<b>創新社區新體驗，內容互動性強，交流更方便</b><br><em>簡單</em><em>快捷</em><em>方便</em><em>建設本地化，垂直型社區</em>',
	'1002'	=> '加入我們',
	
	'1003'	=> '登錄',
	'1004'	=> 'Email',
	'1005'	=> '密碼',
	'1006'	=> '忘記密碼',
	'1007'	=> '推薦小組',
	'1008'	=> '全部小組',
	'1009'	=> '小組分類',
	'1010'	=> '全部小組分類',
	'1011'	=> '申請創建小組',
	'1012'	=> '新成立',
	'1013'	=> '搜索',
	
	//my.html
	'1020'	=> '最新話題',
	'1021'	=> '我發起的話題',
	'1022'	=> '我回應的話題',
	'1023'	=> '我收藏的話題',
	
	'1024'	=> '社區搜索',
	'1025'	=> '我管理的小組',
	'1026'	=> '全部',
	'1027'	=> '我參加的小組',
	
	'1030'	=> '作者',
	'1031'	=> '小組',
	'1032'	=> '去我的小組',
	
	//new_topic.html 
	'1040'	=> '發布帖子',
	'1041'	=> '不好意思，你不是本組成員不能發表帖子，請加入後再發帖^_^',
	'1042'	=> '標題：',
	'1043'	=> '分類：',
	'1044'	=> '選擇分類',
	'1045'	=> '內容：',
	'1046'	=> '評論：',
	'1047'	=> '允許',
	'1048'	=> '不允許',
	'1049'	=> '標簽：',
	'1050'	=> '(多個標簽請用 英文,號分開)',
	'1051'	=> '好了，發布',
	'1052'	=> '返回小組',
	
	//topic.html 
	'1060'	=> '來自: ',
	'1061'	=> '置頂',
	'1062'	=> '取消置頂',
	'1063'	=> '隱藏',
	'1064'	=> '顯示',
	'1065'	=> '移動',
	'1066'	=> '修改',
	'1067'	=> '刪除',
	'1068'	=> '收藏',
	'1069'	=> '添加標簽',
	'1070'	=> '添加',
	'1071'	=> '回復',
	'1072'	=> '提交回復',
	'1073'	=> '你的回應',
	'1074'	=> '不是本組成員不能回應此貼哦^_^',
	'1075'	=> '本帖除作者外不允許任何人評論^_^',
	'1076'	=> '加上去',
	'1077'	=> '返回',
	'1078'	=> '+在該組發布帖子',
	'1079'	=> '誰收藏了這篇帖子',
	'1080'	=> '正在加載中...',
	'1081'	=> '最新話題:',
	
	//edit_*.html 
	'1090'	=> '更改',
	'1091'	=> '的小組設置',
	'1092'	=> '基本信息',
	'1093'	=> '小組圖標',
	'1094'	=> '小組分類',
	'1095'	=> '帖子分類',
	
	'1096'	=> '小組名稱:',
	'1097'	=> '小組介紹:',
	'1098'	=> '加入方式:',
	'1099'	=> '自由加入',
	'1100'	=> '禁止加入',
	'1101'	=> '瀏覽權限：',
	'1102'	=> '完全開放',
	'1103'	=> '僅組員',
	'1104'	=> '自定義角色名稱：',
	'1105'	=> '小組組長：',
	'1106'	=> '小組管理員：',
	'1107'	=> '小組成員：',
	'1108'	=> '更新小組設置',
	'1109'	=> '返回',
	'1110'	=> '小組',
	
	'1111'	=> '小組目前還沒有分類。你可以根據小組內容決定小組屬於哪個類別。你能選擇最多兩個。',
	'1112'	=> '你現在小組所在的類別是：',
	'1113'	=> '刪除',
	'1114'	=> '增加一個新類別',
	
	'1115'	=> '從你的電腦上選擇圖像文件：(僅支持jpg，gif，png格式圖片)',
	
	'1116'	=> '確定',
	'1117'	=> '取消',
	'1118'	=> '點擊進行編輯。。。',
	'1119'	=> '確定刪除嗎?',
	'1120'	=> '刪除成功！',
	'1121'	=> '添加帖子分類：',
	'1122'	=> '提交',
	
	//create.html 
	'1130'	=> '申請創建小組',
	'1131'	=> '請登陸後再申請創建小組哦',
	'1132'	=> '點擊登陸',
	'1133'	=> '暫停申請創建小組，稍後開放',
	'1134'	=> '返回我的小組',
	'1135'	=> '小組名稱：',
	'1136'	=> '小組分類：',
	'1137'	=> '請選擇',
	'1138'	=> '小組介紹：',
	'1139'	=> '我已認真閱讀並同意《社區指導原則》和《免責聲明》',
	'1140'	=> '創建小組',
	
	//all.html
	'1145'	=> '全部小組',
	'1146'	=> '最新小組',
	'1147'	=> '創建於',
	'1148'	=> '人',
	'1149'	=> '推薦小組',
	
	//cate.html
	
	'1155'	=> '小組分類',
	'1156'	=> '添加',
	'1157'	=> '到',
	'1158'	=> '小組分類',
	'1159'	=> '去小組首頁',
	
	//explore.html
	'1160'	=> '隨便看看',
	'1161'	=> '最新活躍會員',
	'1162'	=> '社區標簽',
	'1163'	=> '推薦小組',
	'1164'	=> '最新回應帖子',
	'1165'	=> '最新加入會員',
	'1166'	=> '最新成立小組',
	
	//group.html
	'1170'	=> '創建於',
	'1171'	=> '我是這個小組的',
	'1172'	=> '退出小組',
	'1173'	=> '加入小組',
	'1174'	=> '發布帖子',
	'1175'	=> '最新加入成員',
	'1176'	=> '成員管理',
	'1177'	=> '修改小組設置',
	'1178'	=> '回收站',
	'1179'	=> '瀏覽所有成員',
	
	//topic_edit.html
	'1180'	=> '編輯：',
	'1181'	=> '好了，提交修改',
	
	//theme.html
	'1185'	=> '更換主題',
	
	//group_isaudit.html 
	'1186'	=> '組長',
	'1187'	=> '小組正在審核中',
	
	//group_isopen.html
	'1188'	=> '推薦',
	'1189'	=> '加入方式: 自由加入 瀏覽權限: 僅成員',
	'1190'	=> '成員',
	'1191'	=> '帖子',
	'1192'	=> '本頁永久鏈接',
	
	//topic_tag.html 
	'1200'	=> '话题讨论',
	'1201'	=> '热门标签',
	
	//topic_move.html 
	'1205'	=> '移动帖子：',
	'1206'	=> '选择小组：',
	'1207'	=> '移动',
	
);